tutorials/lagrangian/porousExplicitSourceReactingParcelFoam/filter/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rhoChemistryModel  ODEChemistryModel<icoPoly8ThermoPhysics>;

chemistry       off;

turbulentReaction off;

chemistrySolver ode;

initialChemicalTimeStep 1e-07;

sequentialCoeffs
{
    cTauChem        0.001;
    equilibriumRateLimiter off;
}

EulerImplicitCoeffs
{
    cTauChem        0.05;
    equilibriumRateLimiter off;
}

odeCoeffs
{
    solver          RK;
    eps             0.05;
    scale           1;
}

Cmix            Cmix [ 0 0 0 0 0 0 0 ] 1;


// ************************************************************************* //
